In [1]:
import pandas as pd 
df = pd.DataFrame({'Name':['Ankit','Aravind','Lakshay','Gyan','Pranav'],'A':[41,42,32,23,21],'B':[34,23,23,82,23],'C':[45,34,13,23,25],'D':[55,44,54,63,56],'E':[63,53,67,34,56]})

In [2]:
df

      Name   A   B   C   D   E
0    Ankit  41  34  45  55  63
1  Aravind  42  23  34  44  53
2  Lakshay  32  23  13  54  67
3     Gyan  23  82  23  63  34
4   Pranav  21  23  25  56  56

In [3]:
#Who scored the highest marks in the subject B? 
HS = df['B'].max()
for index,marks in enumerate(df.B):
    if marks == HS:
        print(f'{df.Name[index]} have highest marks in subject B' )

Gyan have highest marks in subject B

In [4]:
#What is the average marks scored in the subject C?
avg = df.C.mean()
print(f'average marks scored in the subject C is :{avg}')

average marks scored in the subject C is :28.0

In [5]:
#Who scored the highest percentage of marks?
df

      Name   A   B   C   D   E
0    Ankit  41  34  45  55  63
1  Aravind  42  23  34  44  53
2  Lakshay  32  23  13  54  67
3     Gyan  23  82  23  63  34
4   Pranav  21  23  25  56  56

In [6]:
percentage = []
for i in range(0,5):
     percentage.append((df.iloc[i,2:6].sum())*100/500)

In [7]:
percentage

[39.4, 30.8, 31.4, 40.4, 32.0]

In [8]:
df['percentage'] = percentage

In [9]:
HS = df['percentage'].max()
for index,marks in enumerate(df.percentage):
    if marks == HS:
        print(f'{df.Name[index]} scored the highest percentage of marks' )

Gyan scored the highest percentage of marks

In [ ]:
df1 = pd.DataFrame({'Name':['Ankit','Aravind','Lakshay','Gyan','Pranav'],'A':[41,42,32,23,21],'B':[34,23,23,82,23],'C':[45,34,13,23,25],'D':[55,44,54,63,56],'E':[63,53,67,34,56]})

In [27]:
x = df1.iloc[0:,1:6]

In [47]:
best_four = []
for i in range(0,5):
    y = x.iloc[i,:].nlargest(n=4).sum()
    best_four.append(y)

In [48]:
best_four

[204, 173, 176, 202, 160]

In [49]:
df1['best_four'] = best_four

In [50]:
df1

      Name   A   B   C   D   E  best_four
0    Ankit  41  34  45  55  63        204
1  Aravind  42  23  34  44  53        173
2  Lakshay  32  23  13  54  67        176
3     Gyan  23  82  23  63  34        202
4   Pranav  21  23  25  56  56        160

In [54]:
percentage = []
for i in range(0,5):
     percentage.append(df1['best_four'][i]*100/400)

In [55]:
percentage

[51.0, 43.25, 44.0, 50.5, 40.0]

In [56]:
df['percentage'] = percentage

In [57]:
HS = df['percentage'].max()
for index,marks in enumerate(df.percentage):
    if marks == HS:
        print(f'{df1.Name[index]} scored the highest percentage of marks' )

Ankit scored the highest percentage of marks